{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\User\Desktop\poll\data\processed_data\..\..\code\C_vs_T_Ftest.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Sep 2021, 22:20:23
{txt}
{com}. 
. /*merge_int*/
. import delimited "merge_int.csv", clear
{res}{text}(12 vars, 900 obs)

{com}. 
. qui reg wtp treatment sb bs bb sb_treatment bs_treatment bb_treatment, r
{txt}
{com}. 
. test treatment sb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} sb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}    1.12
{txt}{col 13}Prob > F ={res}    0.3253
{txt}
{com}. test treatment bs_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bs_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}    2.53
{txt}{col 13}Prob > F ={res}    0.0802
{txt}
{com}. test treatment bb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}    1.41
{txt}{col 13}Prob > F ={res}    0.2443
{txt}
{com}. 
. 
. /*merge_max*/
. import delimited "merge_max.csv", clear
{res}{text}(12 vars, 900 obs)

{com}. 
. qui reg wtp treatment sb bs bb sb_treatment bs_treatment bb_treatment, r
{txt}
{com}. 
. test treatment sb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} sb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}    9.42
{txt}{col 13}Prob > F ={res}    0.0001
{txt}
{com}. test treatment bs_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bs_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}    0.52
{txt}{col 13}Prob > F ={res}    0.5953
{txt}
{com}. test treatment bb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}   15.15
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. /*merge_min*/
. import delimited "merge_min.csv", clear
{res}{text}(12 vars, 900 obs)

{com}. 
. qui reg wtp treatment sb bs bb sb_treatment bs_treatment bb_treatment, r
{txt}
{com}. 
. test treatment sb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} sb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}   56.12
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test treatment bs_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bs_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}   70.62
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test treatment bb_treatment

{p 0 7}{space 1}{text:( 1)}{space 1} {res}treatment = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} bb_treatment = 0{p_end}

{txt}       F(  2,   892) ={res}   50.45
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\User\Desktop\poll\data\processed_data\..\..\code\C_vs_T_Ftest.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Sep 2021, 22:20:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}